<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Insert title here</title>
		<style type="text/css"> /* css jsp 안에다가 할때, 다른 방법으로 인라인, 밖으로 빼기 css 파일 */
			body {
				font-family: "궁서";
				font-size: 20px;
			}
		</style>
		<script type="text/javascript">
			// 배열 array
			cars = ['트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스', '트럭', '승용차', '버스'] /* 자바에서 배열은 {}, 자바스크립트에서 배열은 [] */
			for (var i = 0; i < cars.length; i++) { /* 범위 cars 일일히 바꿔야함 */
				console.log(cars[i])
			}
		</script>
	</head>
	<body>
		<button onclick="alert('내가떠요!!!')">나를 눌러봐요!!!</button> <!-- 잘사용하지는 않음 -->
	</body>
</html>